---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.MEPSection.IsValidObject
source: html/04d00d8e-b252-f8c4-023a-eeb65a5122ee.htm
---
# Autodesk.Revit.DB.Mechanical.MEPSection.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.